/******************************************************************************
 * $Id: dstarcom.h 1.44 2001/11/21 08:36:39 krughsde Serie $
 *
 * Copyright B.Braun Melsungen AG
 * Autor:		H.J.Krug
 * ----------------------------------------------------------------------------
 * Projekt:	   dianet - star
 * Inhalt:	   Segmentdefinitionen
 * ----------------------------------------------------------------------------
 *****************************************************************************/
#ifndef _COMDSTAR_INCLUDED
#define _COMDSTAR_INCLUDED

#include "up.h"
#include "dscomdef.h"
#include "dscomcrc.h"

/* paul included byte packing instructions for data transaction structures */
#ifdef _MSC_VER
#pragma pack(push, 1)
#endif

#ifndef PERF_IMPELLA
#define CDS_PROT_VERSION   0x000e	/* Protokollversion Standard */
#else
#define CDS_PROT_VERSION   0x010e	/* Protokollversion Perfusor Recover Fa.Impella */
#endif
/* MSB : ff Entwicklungsversion */
/* LSB : 0-9 dianet */
/* LSB : a-.. dianet - star */


#define CDS_BOLUSMAN_TIMEOUT	(1.2)	/* [Sekunden] DianetStar Bolus manuell Timeout */
#define CDS_CC_TIMEOUT (1.2)	/* [Sekunden] CC - Timeout */
#define CDS_COMP_FRAME_TOUT (0.4)	/* [Sekunden] Frame - Timeout fuer Compact */
#ifdef KP_COMPACT
#define CDS_FRAME_TIMEOUT (CDS_COMP_FRAME_TOUT)		/* [Sekunden] Frame - Timeout */
#else
#ifdef FP_COMPACT
#define CDS_FRAME_TIMEOUT (CDS_COMP_FRAME_TOUT)		/* [Sekunden] Frame - Timeout */
#else

#define CDS_KVO_VORALARM_BIT_NR		0x11	/* Pumpe laeuft mit Keep Vene Open - Rate */
#define CDS_MINDRUCK_ALARM_BIT_NR   0x12	/* Mindestdruckunterschreitung ( Voralarm ) */
#define CDS_PCA_TASTER_ALARM_BIT_NR  0x13        /* PCA-Taster nicht angeschlossen */
#define CDS_PCA_HLIMVOL_ALARM_BIT_NR 0x14        /* Limit - Stunden-Volumen erreicht */
/* status - alarm bit 21 - 31 Frei */

/******************************************************************************/
/* status - zustand bit 0-7   long */
/* status - zustand bit 0 Frei */
#define CDS_CC_MODE_DOKU_BIT_NR			0x01	/* Pumpe ist im Dokumentationsmode */
#define CDS_CC_FERNSTEUER_BIT_NR		0x02	/* Pumpe ist im Fernsteuermode */
#define CDS_CC_FERNREGEL_BIT_NR			0x03	/* Pumpe ist im Fernregelmode */
#define CDS_NETZBETRIEB_STATUS_BIT_NR	0x04	/* Pumpe ist im Netzbetrieb */
#define CDS_STANDBY_STATUS_BIT_NR		0x05	/* Pumpe befindet sich im Standby */
#define CDS_RUN_READY_STATUS_BIT_NR		0x06	/* Pumpe kann gestartet werden */
#define CDS_RUN_STATUS_BIT_NR			0x07	/* Pumpe (Medikation) laeuft */
/* status - zustand bit 8-15    long */
#define CDS_BOLUS_READY_STATUS_BIT_NR	0x08	/* Bolus kann gestartet werden */
#define CDS_BOLUS_MAN_STATUS_BIT_NR		0x09	/* Bolus wird gegeben */
#define CDS_BOLUS_VOL_STATUS_BIT_NR		0x0A	/* Bolus mit Volumenvorwahl wird abgearbeitet */
#define CDS_BEDIENSTATUS_AKTIV_BIT_NR	0x0B	/* Bedienung aktiv */
#define CDS_BOLUS_INT_STATUS_BIT_NR		0x0C	/* Intervallbolus wird gegeben mit Bolrate */
#define CDS_KVO_STATUS_BIT_NR			0x0D	/* Pumpe laeuft mit Keep Vene Open - Rate */
#define CDS_ALARM_OFF_AKTIV_BIT_NR		0x0E	/* Alarm wird fuer 2 Minuten unterdrueckt, Timer ist aktiv */
#define CDS_AKUST_ALARM_ON_BIT_NR		0x0F	/* Akustischer Alarm ist eingeschaltet */
/*  status - zustand bit 16-20  long */
#define CDS_DATALOCK_STATUS_BIT_NR		0x10	/* Pumpe ist in der Bedienung blockiert */
#define CDS_TROPFUEB_OFF_BIT_NR			0x11	/* Tropfenueberwachung ist aktiviert */
#define CDS_HISTORY_BIT_NR				0x12	/* HISTORY - Speicher ist gefuellt */
#define CDS_VORLAUF_STATUS_BIT_NR		0x13	/* Schnellen Vorlauf zum Greifen der Spritze */
#define CDS_ANTR_SPRITZE_RUECK_BIT_NR	0x14	/* Antriebskopf wird zurueckgefahren */
#define CDS_STATUS_PROTOKOL_BIT_NR		0x15	/* Pumpen Fahrtenschreiber ist aktiv */
#define CDS_BOLUS_INT_AKTIV_BIT_NR		0x16	/* Intervallbolus konfiguriert */
#define CDS_DOSIS_AKTIV_BIT_NR			0x17	/* Dosiskalkulation aktiv */
#define CDS_RELOAD_AKTIV_BIT_NR                 0x18	/* Reload aktiv */
#define CDS_PIGGYBACK_AKTIV_BIT_NR              0x19	/* Piggyback aktiv */
#define CDS_PCA_AKTIV_BIT_NR                    0x1A    /* PCA aktiv */
#define CDS_PROFIL_AKTIV_BIT_NR                 0x1B    /* Profil aktiv */
#define CDS_RAMPTAPER_AKTIV_BIT_NR              0x1C    /* Ramp-Taper aktiv */
#define CDS_DELAY_AKTIV_BIT_NR                  0x1D    /* Delay aktiv */
/* status bits 0x1d - 0x1f ( 30 - 31 )  sind frei */

/* START ******************* Entwicklungshilfe ********************************** */
#ifndef _lint
struct _ds_status_zustand_low	/* debug flagstructur STATUS ZUSTAND */
{
	unsigned int smonitor:1;	/*0 */
	unsigned int doku:1;		/*1 */
	unsigned int fsteuer:1;		/*2 */
	unsigned int fregel:1;		/*3 */
	unsigned int netz:1;		/*4 */
	unsigned int standby:1;		/*5 */
	unsigned int runready:1;	/*6 */
	unsigned int run_stat:1;	/*7 */
	unsigned int bol_read:1;	/*8 */
	unsigned int bol_man_:1;	/*9 */
	unsigned int bol_vol_:1;	/*10 */
	unsigned int bedienst:1;	/*11 */
	unsigned int bol_int:1;		/*12 */
	unsigned int kvo_stat:1;	/*13 */
	unsigned int alarm_of:1;	/*14 */
	unsigned int akust_al:1;	/*15 */
};

typedef struct _ds_status_zustand_low TDS_STATUS_ZUSTAND_LOW;

struct _ds_status_zustand_high	/* debug flagstructur STATUS ZUSTAND */
{
	unsigned int datalock:1;	/*16 */
	unsigned int tropfueb:1;	/*17 */
	unsigned int history_:1;	/*18 */
	unsigned int vorlauf_:1;	/*19 */
	unsigned int antr_spr:1;	/*20 */
	unsigned int st_proto:1;	/*21 */
	unsigned int bol_int_:1;	/*22 */
	unsigned int dosis_ak:1;	/*23 */
	unsigned int reload:1;		/*24 */
	unsigned int piggyback:1;	/*25 */
        unsigned int pcaaktiv:1;        /*26 */
        unsigned int profilaktiv:1;     /*27 */
        unsigned int ramptaperaktiv:1;  /*28 */
        unsigned int delayaktiv:1;      /*29 */
};
typedef struct _ds_status_zustand_high TDS_STATUS_ZUSTAND_HIGH;


struct _ds_status_zustand		/* debug flagstructur STATUS ZUSTAND */
{
	TDS_STATUS_ZUSTAND_HIGH high;	/* */
	TDS_STATUS_ZUSTAND_LOW low;	/* */
};
typedef struct _ds_status_zustand TDS_STATUS_ZUSTAND;

struct _ds_status_alarm_low
{
	unsigned int sp_alarm:1;	/*0 */
	unsigned int sp_voral:1;	/*1 */
	unsigned int sp_leera:1;	/*2 */
	unsigned int druck_al:1;	/*3 */
	unsigned int luft_al_:1;	/*4 */
	unsigned int tropf_al:1;	/*5 */
	unsigned int akku_lee:1;	/*6 */
	unsigned int akku_vor:1;	/*7 */
	unsigned int pumpenkl:1;	/*8 */
	unsigned int rate_ung:1;	/*9 */
	unsigned int erinner_:1;	/*10 */
	unsigned int standby_:1;	/*11 */
	unsigned int vtbd_end:1;	/*12 */
	unsigned int zeit_end:1;	/*13 */
	unsigned int cc_alarm:1;	/*14 */
	unsigned int kvo_ende:1;	/*15 */
};
typedef struct _ds_status_alarm_low TDS_STATUS_ALARM_LOW;

struct _ds_status_alarm_high
{
	unsigned int fernrege:1;	/*16 */
	unsigned int kvo_vora:1;	/*17 */
	unsigned int mindruck:1;	/*18 */
	unsigned int pcataster:1;	/*19 */
	unsigned int pcahlimvol:1;	/*20 */
};

typedef struct _ds_status_alarm_high TDS_STATUS_ALARM_HIGH;

struct _ds_status_alarm			/* debug flagstructur STATUS ZUSTAND */
{
	TDS_STATUS_ALARM_HIGH high;	/* */
	TDS_STATUS_ALARM_LOW low;	/* */
};

typedef struct _ds_status_alarm TDS_STATUS_ALARM;

#endif
/* ENDE ******************* Entwicklungshilfe ********************************** */


/******************************************************************************/
/*  limits - personal   bit 0-3  char */
#define CDS_STATISCH_BIT_NR				0x00	/* Statisch */
#define CDS_DYNAMISCH_BIT_NR			0x01	/* Dynamisch */
#define CDS_AUSALARM_BIT_NR				0x02	/* Ausalarm */
#define CDS_TESTIMPULS_BIT_NR			0x03	/* Testimpuls */
#define CDS_VORALARM_BIT_NR                     0x04	/* Voralarm */

/*  limits - SF   bit 0-7  long */
#define CDS_LIM_SF_BOLUS_BIT_NR			0x00	/* Bolus */
#define CDS_LIM_SF_STANDBY_BIT_NR		0x01	/* Standby - Funktion */
#define CDS_LIM_SF_DRUCK_BIT_NR			0x02	/* Druckberenzung */
